---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MarkupsCreator
source: html/eec153b9-4aa2-31bb-122d-1a8e1ffc4039.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MarkupsCreator Property

"Creator"

## Syntax (C#)
```csharp
public static ForgeTypeId MarkupsCreator { get; }
```